In [1]:
import pandas as pd
import sqlite3

In [2]:
pd.options.mode.chained_assignment = None

In [3]:
conn = sqlite3.connect("../database/score.sqlite")

In [4]:
df = pd.read_sql_query("SELECT * FROM scores", conn)

In [5]:
df = df.T

In [6]:
df.reset_index(inplace= True)

In [7]:
temp = df['index'].str.split(":", n=1, expand = True)

In [8]:
df['EMNO'] = temp[0]

In [9]:
df['Name'] = temp[1]

In [10]:
df.drop(['index'], axis = 1, inplace = True)

In [11]:
df = df[['EMNO', 'Name', 0]]

In [12]:
df.columns = ['EMNO', 'Name', 'Score']

In [13]:
df['Rank'] = df['Score'].rank(ascending = False, method ='dense')

In [14]:
df.sort_values('Rank', inplace = True)

In [15]:
df['Rank'] = df['Rank'].astype('int', copy =False)

In [16]:
conn.close()

In [17]:
df

    EMNO               Name  Score  Rank
1  EM359        NINAD DIGHE    190     1
3  EM317     YOGESH GADEKAR    180     2
0  EM333  NILESHKUMAR PATEL    170     3
2  EM328      VIKRANT YADAV    160     4